{
  "common": {
    "cancel": "ยกเลิก",
    "login": "เข้าสู่ระบบ",
    "untitled": "ไม่ระบุ"
  },
  "error": {
    "working": "กำลังพัฒนา...",
    "login": "พบข้อผิดพลาดขณะที่กำลังเข้าสู่ระบบ",
    "auth/wrong-password": "ชื่อผู้ใช้หรือรหัสผ่านไม่ถูกต้อง"
  },
  "component": {
    "login": {
      "ttlLogin": "เข้าสู่ระบบ",
      "ttlForgotPass": "ลืมรหัสผ่าน",
      "lnkForgotPass": "ลืมรหัสผ่าน?",
      "lnkBackToLogin": "ย้อนกลับ",
      "lblUsername": "ชื่อผู้ใช้",
      "lblPassword": "รหัสผ่าน",
      "btnLogin": "เข้าสู่ระบบ",
      "descForgotPass": "กรุณากรอกที่อยู่อีเมล์ที่ได้ลงทะเบียนไว้ ระบบจะทำการส่งขั้นตอนการรีเซ็ตรหัสผ่านไปให้ท่าน",
      "lblEmail": "ที่อยู่อีเมล์",
      "btnResetPass": "ยืนยัน",
      "providers": {
        "FBS_GOOGLE": "เข้าสู่ระบบด้วยบัญชี Google"
      }
    },
    "logout": {
      "ttlLogout": "กรุณายืนยัน",
      "descLogout": "ต้องการออกจากระบบหรือไม่? กรุณาบันทึกข้อมูลและงานของท่านก่อนที่จะดำเนินการต่อ",
      "btnLogout": "ออกจากระบบ"
    },
    "userMenu": {
      "lblWelcome": "ยินดีต้อนรับ",
      "lnkProfile": "ข้อมูลส่วนตัว"
    },
    "notFound": {
      "pageTitle": "Oops!",
      "title": "ไม่เจอหน้าที่ต้องการ",
      "description": "ขออภัย ระบบได้พยายามหาหน้าที่ท่านต้องการแต่ไม่พบ หากท่านยืนยันว่าหน้านี้เคยมีอยู่ในระบบมาก่อน กรุณาติดต่อผู้ดูแลระบบ"
    },
    "about": {
      "pageTitle": "เกี่ยวกับแอพนี้",
      "lblMenu": "เกี่ยวกับ",
      "descP1": "แอพตัวนี้เป็นเว็บแอพพลิเคชั่นที่ได้ลองพัฒนาขึ้นมาหลังจากที่เริ่มเรียน React มาได้ประมาณ 3 สัปดาห์ (นับรวมจริงๆแล้วก็ประมาณ 12 วัน) ส่วนตัวแล้วใช้ Angular เป็นเฟรมเวิร์คหลักมาตลอดกว่า 3 ปีแต่ที่เริ่มหันมาสนใจไลบรารีตัวนี้เนื่องจากคิดอยู่ว่าจะให้เชี่ยวชาญแค่เฟรมเวิร์คตัวเดียวเลยก็คงจะไม่พอแล้วในทุกวันนี้ และพูดกันตามตรง ก็หวังว่าจะได้ทักษะเพิมขึ้นเพื่อช่วยเพิ่มโอกาสในการได้งานในอนาคตด้วย",
      "descP2": "และด้วยเหตุนี้เอง จึงได้ตัดสินใจลองทำแอพตัวนี้ขึ้นมาซึ่งรวมถึงฟีเจอร์และไลบรารีที่นิยมใช้ในปัจจุบันอื่นๆด้วย แต่เนื่องจากยังเป็นแค่แอพสำหรับลองทักษะเท่านั้น จึงไม่มีฟีเจอร์อะไรมากนอกจากหน้าที่มีให้ชมเพียงไม่กี่หน้าเท่านั้น แต่จะอัพโหลดโค้ดไว้บน Github เพื่อให้สามารถเข้าไปชมได้กัน (หรือไปหยิบมาใช้ก็ได้ ไม่หวงห้าม) เพื่อที่จะได้รู้ว่าโค้ดด้านหลังมีอะไรบ้าง คลิ้กเมนู Source ในแถบเมนูด้านซ้ายเพื่อไปยังหน้า Github"
    },
    "home": {
      "pageTitle": "หน้าหลัก",
      "lblMenu": "หน้าหลัก",
      "title1": "ยินดีต้อนรับ!",
      "desc1": "แอพ React ตัวนี้ถูกพัฒนาขึ้นสำหรับการทดสอบสิ่งที่ได้เรียนรู้มาหลังจากที่ได้เรียนรู้ React ด้วยตนเองมาระยะหนึ่ง แต่ขออนุญาตข้ามไปเข้าเรื่องกันเลยดีกว่า",
      "title2": "เทคโนโลยีที่ใช้",
      "feStackItems": {
        "react": {
          "name": "React",
          "desc": "แน่นอนว่าต้องใช้กับ Typescript"
        },
        "react_router": {
          "name": "React Router",
          "desc": "สำหรับการจัดการ routing ในแอพ"
        },
        "redux": {
          "name": "Redux",
          "desc": "สำหรับจัดการ state ในแอพ เพื่อใช้เก็บค่าที่ใช้ร่วมกันทั่วทั้งแอพ"
        },
        "redux_saga": {
          "name": "Redux Saga",
          "desc": "ใช้สำหรับเป็นมิดเดิลแวร์ของ Redux ใช้ลดและจัดการ side effect ของฟังก์ชั่นต่างๆที่กระทำการแบบ asynchronous ผ่าน Redux"
        },
        "react_helmet": {
          "name": "React Helmet",
          "desc": "สำหรับเปลี่ยนค่าใน tag head และ attribute ของ html ในแอพ"
        },
        "react_i18next": {
          "name": "React + i18next",
          "desc": "สำหรับฟีเจอร์รองรับหลายภาษาในแอพ เป็นฟีเจอร์ที่โดยส่วนตัวแล้วคิดว่าจำเป็นต้องมีติดไว้ทุกครั้งเวลาที่จะเริ่มพัฒนาแอพแบบ SPA ไม่ว่าจะใช้ Angular หรือ Vue.js"
        },
        "material_ui": {
          "name": "Material UI",
          "desc": "ไลบรารี UI สำหรับ React ที่โดยส่วนตัวคิดว่าน่าใช้งานที่สุดเนื่องจากความง่ายในการปรับแต่งและความลื่นไหลของอนิเมชั่นของคอนโพเนนต์"
        },
        "font_awesome": {
          "name": "Font Awesome",
          "desc": "แต่เพราะว่า Material Icon ไม่มีไอคอนเกี่ยวกับพวก social media หรือแบรนด์ต่างๆ จึงจำเป็นต้องหาตัวช่วยไว้เสริม"
        }
      },
      "title3": "Hosting",
      "desc3": "แอพตัวนี้ถูกนำไปไว้บน Firebase Hosting ซึ่งมีขั้นตอนที่ง่ายมากและสะดวกอย่างยิ่งสำหรับ Single Page App ประเภทนี้",
      "title4": "Authentication",
      "desc4": "ในโปรเจคต์ Firebase ที่ตั้งค่าไว้สำหรับแอพตัวนี้มีการเปิดใช้งานการเชื่อมต่อแบบ email-password เอาไว้ (จริงๆได้เปิดใช้งานการเข้าสู่ระบบผ่านบัญชี Google เอาไว้ด้วยแต่เนื่องจากยังไม่มีการใช้งาน จึงปิดเอาไว้ในแอพก่อน)  และยังมีการสร้างแอพพลิเคชั่น Node.js แบบง่ายเพื่อใช้สำหรับตั้งค่า claims (เพิ่มข้อมูล role) ให้กับผู้ใช้ที่ทำการเข้าสู่ระบบมาและนำขึ้นไว้บน Firebase Functions  หากท่านมีชื่อผู้ใช้และรหัสผ่าน (ซึ่งโดยทั่วไปจะแนบมากับใบสมัครงาน) ท่านสามารถเข้าสู่ระบบได้ แต่หากว่าไม่มี ท่านยังสามารถเปิดหน้าต่างๆที่ไม่ต้องการการเข้าสู่ระบบได้อยู่",
      "title5": "ฟีเจอร์อื่นๆ",
      "desc5": "การเชื่อมต่อส่วนใหญ่จะถูกจัดการโดย Firebase Javascript SDK โดยใช้ persistence mode แบบ local  ในระบบนี้ยังมีการเพิ่มฟีเจอร์ที่จะจำภาษาที่เลือกล่าสุดโดยผู้ใช้เอาไว้ เพราะเหตุนี้ เมื่อผู้ใช้กลับเข้ามายังหน้าเว็บเดิมอีกครั้ง ตัวแอพก็จะแสดงในภาษาที่ได้เลือกไว้ล่าสุด"
    },
    "admin": {
      "pageTitle": "ส่วนผู้ดูแลระบบ",
      "lblMenu": "ส่วนผู้ดูแลระบบ"
    },
    "mainNav": {
      "menu": {
        "jobs": "งาน",
        "companies": "บริษัท",
        "candidates": "ผู้สมัคร",
        "settings": "ตั้งค่า",
        "admin": "ส่วนผู้ดูแลระบบ",
        "about": "เกี่ยวกับ"
      }
    },
    "construction": {
      "pageTitle": "อยู่ระหว่างปรับปรุง",
      "title": "อยู่ระหว่างปรับปรุง",
      "description": "ขออภัย หน้านี้กำลังอยู่ในขั้นตอนการพัฒนาและปรับปรุง กรุณาลองใหม่ภายหลัง"
    },
    "jobs": {
      "pageTitle": "ตำแหน่งงาน"
    },
    "companies": {
      "pageTitle": "บริษัท"
    },
    "candidates": {
      "pageTitle": "ผู้สมัคร"
    },
    "settings": {
      "pageTitle": "การตั้งค่า"
    }
  },
  "test": {
    "undefinedRoute": "ลองเปิดหน้าที่ไม่มีอยู่จริง"
  }
}